; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=243, out_folder=./training, instance_id=41, seed=2065, goal_proportion=0.03

(define (problem blocksworld-41)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 - object)
 (:init 
    (arm-empty)
    (clear b93)
    (on b93 b13)
    (on b13 b20)
    (on b20 b234)
    (on b234 b152)
    (on b152 b165)
    (on b165 b10)
    (on b10 b169)
    (on b169 b72)
    (on-table b72)
    (clear b204)
    (on-table b204)
    (clear b119)
    (on b119 b34)
    (on b34 b7)
    (on b7 b222)
    (on-table b222)
    (clear b121)
    (on b121 b209)
    (on b209 b80)
    (on b80 b216)
    (on-table b216)
    (clear b187)
    (on b187 b33)
    (on b33 b225)
    (on b225 b51)
    (on b51 b146)
    (on b146 b23)
    (on b23 b110)
    (on-table b110)
    (clear b84)
    (on b84 b39)
    (on b39 b144)
    (on-table b144)
    (clear b55)
    (on-table b55)
    (clear b111)
    (on b111 b160)
    (on-table b160)
    (clear b82)
    (on-table b82)
    (clear b227)
    (on b227 b238)
    (on-table b238)
    (clear b233)
    (on b233 b228)
    (on b228 b219)
    (on-table b219)
    (clear b125)
    (on b125 b230)
    (on-table b230)
    (clear b132)
    (on b132 b108)
    (on b108 b170)
    (on b170 b194)
    (on b194 b129)
    (on b129 b99)
    (on b99 b186)
    (on b186 b1)
    (on-table b1)
    (clear b5)
    (on b5 b105)
    (on b105 b50)
    (on b50 b41)
    (on b41 b91)
    (on-table b91)
    (clear b172)
    (on b172 b103)
    (on b103 b163)
    (on b163 b46)
    (on-table b46)
    (clear b171)
    (on b171 b42)
    (on b42 b94)
    (on-table b94)
    (clear b76)
    (on b76 b107)
    (on-table b107)
    (clear b151)
    (on b151 b113)
    (on b113 b157)
    (on b157 b231)
    (on-table b231)
    (clear b236)
    (on-table b236)
    (clear b12)
    (on b12 b189)
    (on b189 b191)
    (on b191 b87)
    (on b87 b109)
    (on b109 b127)
    (on b127 b141)
    (on b141 b128)
    (on b128 b67)
    (on-table b67)
    (clear b15)
    (on b15 b131)
    (on b131 b242)
    (on b242 b70)
    (on-table b70)
    (clear b120)
    (on b120 b49)
    (on b49 b101)
    (on b101 b207)
    (on b207 b214)
    (on b214 b158)
    (on b158 b201)
    (on b201 b232)
    (on b232 b217)
    (on-table b217)
    (clear b14)
    (on-table b14)
    (clear b182)
    (on-table b182)
    (clear b47)
    (on b47 b237)
    (on b237 b31)
    (on-table b31)
    (clear b115)
    (on b115 b95)
    (on b95 b221)
    (on b221 b223)
    (on-table b223)
    (clear b44)
    (on b44 b124)
    (on b124 b22)
    (on b22 b25)
    (on b25 b126)
    (on b126 b30)
    (on b30 b155)
    (on b155 b68)
    (on b68 b203)
    (on b203 b177)
    (on b177 b192)
    (on-table b192)
    (clear b64)
    (on b64 b69)
    (on-table b69)
    (clear b63)
    (on b63 b193)
    (on b193 b215)
    (on-table b215)
    (clear b180)
    (on b180 b66)
    (on-table b66)
    (clear b205)
    (on-table b205)
    (clear b106)
    (on b106 b17)
    (on-table b17)
    (clear b4)
    (on b4 b88)
    (on b88 b211)
    (on b211 b156)
    (on b156 b143)
    (on b143 b86)
    (on b86 b75)
    (on b75 b96)
    (on b96 b183)
    (on b183 b57)
    (on b57 b243)
    (on b243 b32)
    (on b32 b36)
    (on-table b36)
    (clear b81)
    (on b81 b102)
    (on b102 b137)
    (on b137 b98)
    (on b98 b123)
    (on b123 b8)
    (on b8 b62)
    (on-table b62)
    (clear b89)
    (on-table b89)
    (clear b162)
    (on b162 b235)
    (on b235 b16)
    (on b16 b168)
    (on-table b168)
    (clear b26)
    (on b26 b224)
    (on-table b224)
    (clear b229)
    (on b229 b145)
    (on b145 b167)
    (on b167 b241)
    (on b241 b29)
    (on-table b29)
    (clear b174)
    (on b174 b140)
    (on b140 b78)
    (on b78 b71)
    (on b71 b136)
    (on b136 b164)
    (on b164 b59)
    (on b59 b2)
    (on-table b2)
    (clear b27)
    (on b27 b150)
    (on b150 b202)
    (on-table b202)
    (clear b104)
    (on b104 b38)
    (on b38 b188)
    (on b188 b179)
    (on b179 b61)
    (on b61 b148)
    (on b148 b100)
    (on-table b100)
    (clear b206)
    (on b206 b181)
    (on-table b181)
    (clear b122)
    (on b122 b90)
    (on-table b90)
    (clear b35)
    (on b35 b117)
    (on b117 b138)
    (on b138 b218)
    (on b218 b195)
    (on-table b195)
    (clear b53)
    (on-table b53)
    (clear b190)
    (on-table b190)
    (clear b220)
    (on-table b220)
    (clear b176)
    (on b176 b239)
    (on b239 b134)
    (on b134 b37)
    (on b37 b3)
    (on-table b3)
    (clear b112)
    (on-table b112)
    (clear b200)
    (on b200 b79)
    (on b79 b208)
    (on b208 b85)
    (on b85 b198)
    (on b198 b18)
    (on-table b18)
    (clear b240)
    (on b240 b133)
    (on b133 b185)
    (on b185 b45)
    (on-table b45)
    (clear b28)
    (on b28 b199)
    (on b199 b226)
    (on b226 b149)
    (on b149 b184)
    (on b184 b74)
    (on b74 b77)
    (on-table b77)
    (clear b118)
    (on b118 b173)
    (on b173 b175)
    (on-table b175)
    (clear b6)
    (on b6 b114)
    (on b114 b213)
    (on b213 b56)
    (on b56 b147)
    (on b147 b210)
    (on b210 b139)
    (on-table b139)
    (clear b196)
    (on b196 b19)
    (on-table b19)
    (clear b52)
    (on b52 b197)
    (on b197 b83)
    (on b83 b40)
    (on b40 b11)
    (on b11 b142)
    (on-table b142)
    (clear b135)
    (on-table b135)
    (clear b116)
    (on b116 b58)
    (on b58 b130)
    (on b130 b153)
    (on-table b153)
    (clear b92)
    (on-table b92)
    (clear b166)
    (on b166 b154)
    (on b154 b73)
    (on b73 b212)
    (on-table b212)
    (clear b43)
    (on b43 b97)
    (on b97 b9)
    (on b9 b60)
    (on b60 b21)
    (on-table b21)
    (clear b48)
    (on b48 b178)
    (on b178 b54)
    (on-table b54)
    (clear b24)
    (on b24 b65)
    (on b65 b159)
    (on b159 b161)
    (on-table b161))
 (:goal  (and 
    (clear b5)
    (on b5 b7)
    (on b7 b1)
    (on b1 b2)
    (on b2 b3)
    (on b3 b4)
    (on b4 b6)
    (on-table b6))))

; plan
1. (unstack b6 b114)
   deleted: (on b6 b114) (clear b6) (arm-empty)
   added: (holding b6) (clear b114)
   goals met: 1 of 8
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 8
3. (unstack b119 b34)
   deleted: (on b119 b34) (clear b119) (arm-empty)
   added: (holding b119) (clear b34)
   goals met: 2 of 8
4. (putdown b119)
   deleted: (holding b119)
   added: (clear b119) (arm-empty) (on-table b119)
   goals met: 2 of 8
5. (unstack b132 b108)
   deleted: (on b132 b108) (clear b132) (arm-empty)
   added: (holding b132) (clear b108)
   goals met: 2 of 8
6. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 2 of 8
7. (unstack b108 b170)
   deleted: (on b108 b170) (clear b108) (arm-empty)
   added: (holding b108) (clear b170)
   goals met: 2 of 8
8. (putdown b108)
   deleted: (holding b108)
   added: (clear b108) (arm-empty) (on-table b108)
   goals met: 2 of 8
9. (unstack b170 b194)
   deleted: (on b170 b194) (clear b170) (arm-empty)
   added: (holding b170) (clear b194)
   goals met: 2 of 8
10. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 2 of 8
11. (unstack b174 b140)
   deleted: (on b174 b140) (clear b174) (arm-empty)
   added: (holding b174) (clear b140)
   goals met: 2 of 8
12. (putdown b174)
   deleted: (holding b174)
   added: (clear b174) (arm-empty) (on-table b174)
   goals met: 2 of 8
13. (unstack b140 b78)
   deleted: (on b140 b78) (clear b140) (arm-empty)
   added: (holding b140) (clear b78)
   goals met: 2 of 8
14. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 2 of 8
15. (unstack b176 b239)
   deleted: (on b176 b239) (clear b176) (arm-empty)
   added: (holding b176) (clear b239)
   goals met: 2 of 8
16. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 2 of 8
17. (unstack b194 b129)
   deleted: (on b194 b129) (clear b194) (arm-empty)
   added: (holding b194) (clear b129)
   goals met: 2 of 8
18. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 2 of 8
19. (unstack b129 b99)
   deleted: (on b129 b99) (clear b129) (arm-empty)
   added: (holding b129) (clear b99)
   goals met: 2 of 8
20. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 2 of 8
21. (unstack b239 b134)
   deleted: (on b239 b134) (clear b239) (arm-empty)
   added: (holding b239) (clear b134)
   goals met: 2 of 8
22. (putdown b239)
   deleted: (holding b239)
   added: (clear b239) (arm-empty) (on-table b239)
   goals met: 2 of 8
23. (unstack b134 b37)
   deleted: (on b134 b37) (clear b134) (arm-empty)
   added: (holding b134) (clear b37)
   goals met: 2 of 8
24. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 2 of 8
25. (unstack b34 b7)
   deleted: (on b34 b7) (clear b34) (arm-empty)
   added: (holding b34) (clear b7)
   goals met: 2 of 8
26. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 2 of 8
27. (unstack b37 b3)
   deleted: (on b37 b3) (clear b37) (arm-empty)
   added: (holding b37) (clear b3)
   goals met: 2 of 8
28. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 2 of 8
29. (unstack b78 b71)
   deleted: (on b78 b71) (clear b78) (arm-empty)
   added: (holding b78) (clear b71)
   goals met: 2 of 8
30. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 2 of 8
31. (unstack b71 b136)
   deleted: (on b71 b136) (clear b71) (arm-empty)
   added: (holding b71) (clear b136)
   goals met: 2 of 8
32. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 2 of 8
33. (unstack b136 b164)
   deleted: (on b136 b164) (clear b136) (arm-empty)
   added: (holding b136) (clear b164)
   goals met: 2 of 8
34. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 2 of 8
35. (unstack b164 b59)
   deleted: (on b164 b59) (clear b164) (arm-empty)
   added: (holding b164) (clear b59)
   goals met: 2 of 8
36. (putdown b164)
   deleted: (holding b164)
   added: (clear b164) (arm-empty) (on-table b164)
   goals met: 2 of 8
37. (unstack b59 b2)
   deleted: (on b59 b2) (clear b59) (arm-empty)
   added: (holding b59) (clear b2)
   goals met: 2 of 8
38. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 2 of 8
39. (unstack b99 b186)
   deleted: (on b99 b186) (clear b99) (arm-empty)
   added: (holding b99) (clear b186)
   goals met: 2 of 8
40. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 2 of 8
41. (unstack b186 b1)
   deleted: (on b186 b1) (clear b186) (arm-empty)
   added: (holding b186) (clear b1)
   goals met: 2 of 8
42. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 2 of 8
43. (unstack b4 b88)
   deleted: (on b4 b88) (clear b4) (arm-empty)
   added: (holding b4) (clear b88)
   goals met: 2 of 8
44. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 3 of 8
45. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 8
46. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 4 of 8
47. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 8
48. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 5 of 8
49. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 8
50. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 8
51. (unstack b7 b222)
   deleted: (on b7 b222) (clear b7) (arm-empty)
   added: (holding b7) (clear b222)
   goals met: 6 of 8
52. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 7 of 8
53. (unstack b5 b105)
   deleted: (on b5 b105) (clear b5) (arm-empty)
   added: (holding b5) (clear b105)
   goals met: 6 of 8
54. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 8 of 8
